damBreak/256x128/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    leftWall
    {
        type            patch;
        nFaces          128;
        startFace       65152;
    }
    rightWall
    {
        type            patch;
        nFaces          128;
        startFace       65280;
    }
    lowerWall
    {
        type            patch;
        nFaces          256;
        startFace       65408;
    }
    atmosphere
    {
        type            patch;
        nFaces          256;
        startFace       65664;
    }
    defaultFaces
    {
        type            empty;
        inGroups        1(empty);
        nFaces          65536;
        startFace       65920;
    }
)

// ************************************************************************* //
